<?php
return [
	// 購物訂單 狀態語系
	'game_priority' => [
		1 => "全場大小",   // 通用
        2 => "全場讓球",   // 通用
        3 => "上半場大小",   // 通用
        4 => "上半場讓球",   // 通用
        5 => "全場獨贏",   // 通用
        6 => "上半場獨贏",   // 通用
        7 => "全場波膽",   // 足
        8 => "上半場-波膽",   // 足
        9 => "全場讓分",   // 籃
        10 => "上半場讓分",   // 籃
        11 => "第1節讓分",   // 籃
        12 => "第1節大小",   // 籃
        13 => "第1節單雙",   // 籃
        14 => "第1節獨贏",   // 籃
        15 => "第2節讓分",   // 籃
        16 => "第2節大小",   // 籃
        17 => "第2節單雙",   // 籃
        18 => "第2節獨贏",   // 籃
        19 => "第3節讓分",   // 籃
        20 => "第3節大小",   // 籃
        21 => "第3節單雙",   // 籃
        22 => "第3節獨贏",   // 籃
        23 => "第4節讓分",   // 籃
        24 => "第4節大小",   // 籃
        25 => "第4節單雙",   // 籃
        26 => "第4節獨贏",   // 籃
        27 => "前5局大小",   // 棒
        28 => "前5局獨贏",   // 棒
        29 => "前5局讓球",   // 棒
	],
	// 狀態語系
	"order_status" => [
		"已取消",
		"等待成立",
		"等待開獎",
		"等待派獎",
		"已派獎",
		"等待審核"
	]
];