<?php
return [
    // lsport , priority 對應表
    "lsport_priority" => [
        154914 => [
            226 => ["priority" => "1", "cn" => "全场独赢", "tw" => "全場獨贏"],
            342 => ["priority" => "3", "cn" => "全场让分", "tw" => "全場讓分"],
            28 => ["priority" => "5", "cn" => "全场大小", "tw" => "全場大小"],
            51 => ["priority" => "7", "cn" => "全场单双", "tw" => "全場單雙"],
            235 => ["priority" => "2", "cn" => "前五局独赢", "tw" => "前五局獨贏"],
            281 => ["priority" => "4", "cn" => "前五局让分", "tw" => "前五局讓分"],
            236 => ["priority" => "6", "cn" => "前五局大小", "tw" => "前五局大小"],
            602 => ["priority" => "8", "cn" => "全场波胆", "tw" => "全场波膽"],
            1618 => ["priority" => "9", "cn" => "前五局独赢", "tw" => "前五局獨贏"],
        ],
        48242 => [
            226 => ["priority" => "101", "cn" => "全场独赢", "tw" => "全場獨贏"],
            63 => ["priority" => "102", "cn" => "上半场独赢", "tw" => "上半場獨贏"],
            342 => ["priority" => "103", "cn" => "全场让球", "tw" => "全場讓球"],
            53 => ["priority" => "104", "cn" => "上半场让球", "tw" => "上半場讓球"],
            28 => ["priority" => "105", "cn" => "全场大小", "tw" => "全場大小"],
            77 => ["priority" => "106", "cn" => "上半场大小", "tw" => "上半場大小"],
            51 => ["priority" => "107", "cn" => "全场单双", "tw" => "全場單雙"],
            62 => ["priority" => "108", "cn" => "上半场单双", "tw" => "上半場單雙"],
            202 => ["priority" => "109", "cn" => "第1节独赢", "tw" => "第1節獨贏"],
            64 => ["priority" => "110", "cn" => "第1节让分", "tw" => "第1節讓分"],
            21 => ["priority" => "111", "cn" => "第1节大小", "tw" => "第1節大小"],
            72 => ["priority" => "112", "cn" => "第1节单双", "tw" => "第1節單雙"],
            203 => ["priority" => "113", "cn" => "第2节独赢", "tw" => "第2節獨贏"],
            65 => ["priority" => "114", "cn" => "第2节让分", "tw" => "第2節讓分"],
            45 => ["priority" => "115", "cn" => "第2节大小", "tw" => "第2節大小"],
            73 => ["priority" => "116", "cn" => "第2节单双", "tw" => "第2節單雙"],
            204 => ["priority" => "117", "cn" => "第3节独赢", "tw" => "第3節獨贏"],
            66 => ["priority" => "118", "cn" => "第3节让分", "tw" => "第3節讓分"],
            46 => ["priority" => "119", "cn" => "第3节大小", "tw" => "第3節大小"],
            74 => ["priority" => "120", "cn" => "第3节单双", "tw" => "第3節單雙"],
            205 => ["priority" => "121", "cn" => "第4节独赢", "tw" => "第4節獨贏"],
            67 => ["priority" => "122", "cn" => "第4节让分", "tw" => "第4節讓分"],
            47 => ["priority" => "123", "cn" => "第4节大小", "tw" => "第4節大小"],
            75 => ["priority" => "124", "cn" => "第4节单双", "tw" => "第4節單雙"],
        ],
        6046 => [
            1 => ["priority" => "201", "cn" => "全场独赢", "tw" => "全場獨贏"],
            41 => ["priority" => "202", "cn" => "上半场独赢", "tw" => "上半場獨贏"],
            3 => ["priority" => "203", "cn" => "全场让分", "tw" => "全場讓分"],
            64 => ["priority" => "204", "cn" => "上半场让分", "tw" => "上半場讓分"],
            2 => ["priority" => "205", "cn" => "全场大小", "tw" => "全場大小"],
            21 => ["priority" => "206", "cn" => "上半场大小", "tw" => "上半場大小"],
            72 => ["priority" => "207", "cn" => "上半场单双", "tw" => "上半場單雙"],
            5 => ["priority" => "208", "cn" => "全场单双", "tw" => "全場單雙"],
        ],
        35232 => [
            226 => ["priority" => "301", "cn" => "全场独赢", "tw" => "全場獨贏"],
            342 => ["priority" => "302", "cn" => "全场让球", "tw" => "全場讓球"],
            28 => ["priority" => "303", "cn" => "全场大小", "tw" => "全場大小"],
            51 => ["priority" => "304", "cn" => "全场单双", "tw" => "全場單雙"],
        ]
    ],
    // 玩法名稱替換
    "lsport_market_bet" => [
        "1" => [
            "cn" => "主",
            "tw" => "主"
        ],
        "2" => [
            "cn" => "客",
            "tw" => "客"
        ],
        "Over" => [
            "cn" => "大",
            "tw" => "大"
        ],
        "Under" => [
            "cn" => "小",
            "tw" => "小"
        ],
        "Odd" => [
            "cn" => "单",
            "tw" => "單"
        ],
        "Even" => [
            "cn" => "双",
            "tw" => "雙"
        ],
        "X" => [
            "cn" => "平",
            "tw" => "平"
        ]
    ]
];